app/views/topics/show.html.erb

     <p class="lead"><%= @topic.description %></p>
     <% @topic.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."topic_id" = ?  [["topic_id", 1]]

             submitted <%= time_ago_in_words(post.created_at) %> ago by <%= post.user.name %> <br>
             <%= post.comments.count %> Comments
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 52]]

     <% end %>
     <% @topic.sponsored_posts.each do |post| %>
---
SELECT "sponsored_posts".* FROM "sponsored_posts" WHERE "sponsored_posts"."topic_id" = ?  [[nil, 1]]