app/controllers/advertisements_controller.rb

  def index
    @advertisements = Advertisement.all
---
SELECT "advertisements".* FROM "advertisements"

  def show
    @advertisement = Advertisement.find(params[:id])
---
SELECT  "advertisements".* FROM "advertisements" WHERE "advertisements"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @advertisement = Advertisement.new
    @advertisement.title = params[:advertisement][:title]
    @advertisement.body = params[:advertisement][:body]
    @advertisement.price = params[:advertisement][:price]

    if @advertisement.save
---
INSERT INTO "advertisements" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test"], ["body", "Working Good!\r\n"], ["created_at", "2017-06-08 23:16:32.804769"], ["updated_at", "2017-06-08 23:16:32.804769"]]