app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Boom"], ["body", "Boom"], ["created_at", "2017-06-09 00:50:28.123667"], ["updated_at", "2017-06-09 00:50:28.123667"]]
---
  def create
    @question = Question.new
    @question.title = params[:question][:title]
    @question.body = params[:question][:body]

    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "questions" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["title", "Hello1"], ["body", "Hello1"], ["updated_at", "2017-06-09 00:52:08.211430"], ["id", 2]]
---
  def update
        @question = Question.find(params[:id])
    @question.title = params[:question][:title]
    @question.body = params[:question][:body]

    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]
---
  def destroy
      @question = Question.find(params[:id])

    if @question.destroy